tap 'caskroom/fonts'
tap 'homebrew/science'
tap 'neovim/neovim'
tap 'aspnet/k'
tap 'thoughtbot/formulae'
tap 'karan/karan'
tap 'jlhonora/lsusb'

brew 'caskroom/cask/brew-cask'

brew 'eigen'      # c++ template library for linear algebra: matrices, vectors, numerical solvers, and related algorithms
brew 'opencv'     # computer vision and machine learning software library
brew 'veclibfort' # full GNU Fortran compatibility for Apple's vecLib BLAS/LAPACK

brew 'mono'       # cross platform, open source .NET framework
brew 'kvm'        # K version manager, see https://github.com/aspnet/Home/wiki/version-manager

brew 'elasticsearch'

brew 'z'
brew 'cheat'

brew 'gotags'

# install GNU core utilities (those that come with OS X are outdated)
# don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# install some other useful utilities like `sponge`
brew 'moreutils'
# install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# install GNU `sed`, overwriting the built-in `sed`
brew 'gnu-sed', args: ['default-names']

# install Bash 4
# note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before running `chsh`.
brew 'bash'
brew 'bash-completion'

brew 'wget', args: ['enable-iri']
brew 'reattach-to-user-namespace'
brew 'clipper'
brew 'selecta'
brew 'mongodb'
brew 'ansifilter'   # strips ANSI codes or converts them to HTML, TeX, LaTeX, RTF or BBCode
brew 'rcm'          # rc file (dotfile) management
brew 'gitsh'        # an interactive shell for git
brew 'liftoff'      # CLI for creating and configuring new Xcode projects
brew 'gitignore'    # "joe", a tool that generates .gitignore files from the command line
brew 'spark'        # ▁▂▃▅▂▇
brew 'zmap'         # cool network scanner
brew 'nmap'
brew 'lsusb'
brew 'fish'
brew 'zsh'
brew 'zsh-completions'

brew 'wireshark', args: ['with-qt']
brew 'weechat', args: ['with-python', 'with-perl']
brew 'irssi'

# install RingoJS and Narwhal
# note that the order in which these are installed is important
# see http://git.io/brew-narwhal-ringo.
brew 'ringojs'
brew 'narwhal'

brew 'ant'
brew 'maven'
brew 'rbenv'

brew 'doxygen'

# install more recent versions of some OS X tools
brew 'vim', args: ['override-system-vi', 'with-lua', 'with-perl', 'with-python3', 'with-ruby']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/screen'

brew 'python'
brew 'python3'

brew 'pyqt5'

brew 'ghc'
brew 'cabal-install'

brew 'mysql'
brew 'redis'
brew 'boot2docker'

# install XML libs
brew 'libxml2'
brew 'libxslt'

brew 'tmux'
brew 'nginx'
brew 'pow'
brew 'ctags'
brew 'llvm'
brew 'gs'
brew 'autossh'
brew 'graphviz'
brew 'the_silver_searcher'
brew 'ack'
brew 'bfg'
brew 'foremost'
brew 'svn'
brew 'git'
brew 'git-flow'
brew 'darcs'
brew 'hashpump'

cask 'xquartz'
brew 'imagemagick', args: ['with-webp', 'with-x11']

brew 'lynx'
brew 'node'
brew 'iojs'
brew 'p7zip'
brew 'pv'
brew 'rename'
brew 'rhino'
brew 'sqlite'
brew 'sqlmap'
brew 'tree'
brew 'ucspi-tcp'
brew 'webkit2png'
brew 'zopfli'
brew 'ffmpeg'
brew 'mplayer'
brew 'mplayershell'
brew 'youtube-dl'
brew 'homebrew/versions/lua52'
brew 'thefuck'
brew 'scala'
brew 'sbt'
brew 'httpie'

cask 'dropbox'
cask 'caffeine'
cask 'tiled'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-hangouts'
cask 'skype'
cask 'send-to-kindle'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'macvim'
cask 'flux'
cask 'miro-video-converter'
cask 'opera'
cask 'opera-developer'
cask 'opera-next'
cask 'sublime-text'
cask 'sublime-text3'
cask 'heroku-toolbelt'
cask 'the-unarchiver'
cask 'torbrowser'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'vlc'
cask 'audacity'
cask 'handbrake'
cask 'github'
cask 'sourcetree'
cask 'lighttable'
cask 'vagrant'
cask 'atom'
cask 'alfred'
cask 'evernote'
cask 'poedit'
cask 'sequel-pro'
cask 'teamviewer'
cask 'clock'
cask 'toggldesktop'
cask 'totalspaces'
cask 'istat-menus'
cask 'nvalt'
cask 'skitch'
cask 'bittorrent-sync'
cask 'textmate'
cask 'anvil'
cask 'commandq'
cask 'mplayerx'
cask 'onepassword'
cask 'adium'
cask 'superduper'
cask 'karabiner'
cask 'seil'
cask 'showyedge'
cask 'slack'
cask 'screenhero'
cask 'mou'
cask 'torbrowser'
cask 'java'
cask 'caskroom/versions/java7'
cask 'intellij-idea-ce'
cask 'aquamacs'
cask 'arduino'
cask 'boot2docker'
cask 'brackets'
cask 'breach'
cask 'calibre'
cask 'daisydisk'
cask 'forklift'
cask 'genymotion'
cask 'graphviz'
cask 'kindle'
cask 'kitematic'
cask 'komanda'
cask 'macdown'
cask 'pg-commander'
cask 'pgadmin3'
cask 'rubymine'
cask 'slate'
cask 'amethyst'
cask 'steam'
cask 'tunnelbear'
cask 'tunnelblick'
cask 'wineskin-winery'
cask 'postgres'
# cask 'spotify'
# cask 'eclipse-ide'
# cask 'android-studio'

cask 'font-inconsolata'
cask 'font-vollkorn'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-comic-neue'
cask 'font-courier-prime'
cask 'font-source-serif-pro'

# quick look plugins:
# https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
