tap 'caskroom/fonts'
tap 'neovim/neovim'
tap 'thoughtbot/formulae'
tap 'd12frosted/emacs-plus'
tap 'Goles/battery'
tap 'simeji/jid'

brew 'caskroom/cask/brew-cask'

brew 'jid'
brew 'z'
brew 'cheat'
brew 'battery'
brew 'jenv'
brew 'yarn'
brew 'asciinema'
brew 'catimg'
brew 'rlwrap'
brew 'consul'

brew 'flow'
brew 'hub'
brew 'watchman'

brew 'bash'
brew 'bash-completion'

brew 'wifi-password'
brew 'git-extras'

brew 'wget', args: ['enable-iri']
brew 'reattach-to-user-namespace'
brew 'rcm'          # rc file (dotfile) management
brew 'nmap'
brew 'fish'
brew 'zsh'

brew 'emacs-plus', args: ['with-cocoa', 'with-gnutls', 'with-librsvg', 'with-imagemagick', 'with-spacemacs-icon]

brew 'weechat', args: ['with-python', 'with-perl']

brew 'rbenv'

# more recent versions of some OS X tools
brew 'vim', args: ['override-system-vi', 'with-lua', 'with-perl', 'with-python3', 'with-ruby']
brew 'neovim'

brew 'python'
brew 'python3'

brew 'sbt'

brew 'ghc'
brew 'cabal-install'

brew 'mysql'
brew 'redis'

brew 'tmux'
brew 'nginx'
brew 'pow'
brew 'ctags'
brew 'graphviz'
brew 'the_silver_searcher'
brew 'git'

brew 'terminal-notifier'

brew 'sqlite'
brew 'httpie'
brew 'htop'

cask 'dropbox'
cask 'skype'
cask 'Caskroom/versions/iterm2-beta'
cask 'macvim'
cask 'flux'
cask 'miro-video-converter'
cask 'opera'
cask 'opera-developer'
cask 'sublime-text'
cask 'sublime-text3'
cask 'the-unarchiver'
cask 'torbrowser'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'vlc'
cask 'vagrant'
cask 'atom'
cask 'alfred'
cask 'evernote'
cask 'totalspaces'
cask 'istat-menus'
cask 'nvalt'
cask 'karabiner'
cask 'seil'
cask 'showyedge'
cask 'slack'
cask 'screenhero'
cask 'aquamacs'
cask 'graphviz'
cask 'kitematic'
cask 'macdown'
cask 'pg-commander'
cask 'pgadmin3'
cask 'slate'
cask 'postgres'
cask 'anvil'

cask 'font-inconsolata'
cask 'font-vollkorn'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-courier-prime'
cask 'font-source-serif-pro'

# quick look plugins:
# https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'amethyst'
